[
    {
        "title": "World tour of Solar Butterfly at IITH",
        "content": "As part of their mission to present 1,000 innovative ideas to combat global warming, the Solar Butterfly team visited IIT Hyderabad to educate and inspire the next generation of change-makers. This initiative demonstrates that solutions to climate change are not only possible but accessible. With cutting-edge technologies—including solar panels made from recycled ocean plastic bottles with over 24% efficiency—the SolarButterfly embodies sustainable living and the shift from fossil fuels to clean energy. Since its launch in June 2022, this visionary project has set off on a four-year journey across six continents and 90 countries, spreading awareness and knowledge about climate action. The Students of IIT Hyderabad had an enriching experience interacting with the members of the Solar Butterfly team! The event started off with a presentation by the amazing team of SolarButterfly followed by a demonstration of the same. The discussions were vibrant, covering everything from innovative renewable energy solutions to practical steps individuals can take to combat climate change. Students engaged enthusiastically, asking questions and sharing ideas, all while gaining insights from the team’s inspiring journey. This interaction not only sparked new thoughts but also reinforced the importance of collective action in creating a sustainable future.",
        "imagePath": "pic5.jpg",
        "readMoreHref": "/news/solar-butterfly"
    },
    {
        "title" : "Prayas Rural Development Cell - IITH", 
        "content" : "The Rural Development Centre (RDC) at the Indian Institute of Technology Hyderabad (IITH) is actively conducting physical classes in six ZPHS schools across Kandi Mandal: Kandi, Mamidipalli, Kalivemula, Cheryal, Indrakaran, and Yeddumailaram. Faculty, students, and staff from IITH are visiting these schools regularly to teach Mathematics, Physics, Chemistry, Biology, and English, enriching the regular school curriculum with additional learning opportunities. As part of this initiative, RDC and PRAYAS, a student-led club under RDC, recently organized PRERNA, a motivational event aimed at inspiring students and parents from these schools to pursue higher education and professional careers. The event featured eminent speakers who shared their journeys of overcoming challenges in rural settings to achieve successful careers. IITH Director Prof. B.S. Murty emphasized the importance of collective growth, stating, “Real growth is when everyone grows together,” while also highlighting RDC’s ongoing rural development efforts such as skill development and student motivation. \n The event Deeksha was thoughtfully organized by RDC and Prayas with the aim of motivating students to continue their education and strive for academic excellence. The initiative was designed to provide guidance, encouragement, and exposure to young students, helping them understand the importance of education in shaping their future. As part of Deeksha, an exam was conducted for students from the 7th, 8th, and 9th grades of six government schools: ZPHS Kandi, ZPHS Indrakaran, ZPHS Kalivemula, ZPHS Cheriyal, ZPHS Mamidpally, and ZPHS Yeddumailaram. This exam served as a selection process to identify dedicated and high-performing students. Based on their performance, two students from each grade in each school were chosen and invited to visit the campus. The selection was aimed at recognizing academic merit and providing these students with an enriching experience that would inspire them to aim higher in their studies.\n After the lecture, the students were taken to the Physics Lab, where they explored various scientific instruments and learned about their functions and applications. One of the highlights of the visit was witnessing the prism experiment, where they observed the fascinating phenomenon of white light splitting into seven colors—a vivid demonstration of light dispersion. \n SRUSTI - Where Curiosity meets Discovery The Srusti is one of the premier annual event organized by RDC and Prayas at IIT Hyderabad, aimed at fostering scientific curiosity, technological innovation, and research-driven problem-solving among students. This initiative provides an open platform for young minds to present groundbreaking ideas, encouraging them to explore diverse scientific and engineering disciplines. Through Srusti, participants gain exposure to real-world challenges, enhancing their analytical, experimental, and creative skills. The 2025 edition of Srusti witnessed an enthusiastic response, with 108 project submissions in the first round. These projects, spanning various domains of science and technology, underwent a rigorous evaluation process conducted by a panel of experts, including faculty members, researchers, and industry professionals. Based on the originality, feasibility, and impact of the proposed ideas, 36 projects were shortlisted for the final round, which is scheduled to be held at IIT Hyderabad on March 1st, 2025. \n",
        "imagePath": "pic6.png",
        "readMoreHref": "/news/prayas-rdc"
    }
]